# Kamil Sienkiewicz <sienkiewiczkm@gmail.com>
# ------------------------------------------------------------------------------

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Fonts

cask "font-atkinson-hyperlegible"
cask "font-roboto"
cask "font-roboto-slab"
cask "font-ubuntu"
cask "font-ubuntu-condensed"

# Monospace fonts
cask "font-fantasque-sans-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"

# ------------------------------------------------------------------------------
# CLI tools

brew "atuin"
brew "bitwarden-cli"
brew "borgbackup"
brew "cmake"
brew "cocoapods"
brew "colordiff"
brew "curl"
brew "difftastic"
brew "eza"                  # ls improved; https://github.com/eza-community/eza
brew "ffmpeg"               # video tools
brew "fzf"                  # fuzzy search
brew "gh"                   # GitHub cli
brew "git"
brew "git-delta"
brew "gnupg"                # GPG
brew "helm"
brew "helm-docs"
brew "helmfile"
brew "hopenpgp-tools"       # GPG tools: hkt, hokey, hop, hot
brew "htop"
brew "httpie"
brew "hyperfine"            # benchmarking
brew "imagemagick"          # image utilities: magick, convert, identify, mogrify etc.
brew "insect"               # scientific calculator
brew "jq"
brew "k9s"
brew "ledger"
brew "llvm"                 # clang
brew "lnav"                 # log navigator
brew "moreutils"            # chronic, vipe and others
brew "neovim"
brew "p7zip"                # 7z
brew "paperkey"             # saving keys in text format for backups
brew "par2"                 # PAR 2.0 generation and verification tool
brew "qrencode"             # QR code generator
brew "rename"               # rename in CLI with regex
brew "speedtest-cli"        # https://www.speedtest.net/apps/cli
brew "stow"
brew "svgo"                 # optimization tool for SVGs
brew "the_silver_searcher"  # ag, https://github.com/ggreer/the_silver_searcher
brew "tldr"                 # concise man pages based on examples
brew "tmux"                 # terminal multiplexer
brew "watch"                # watch tool to repeat command
brew "wget"
brew "ykman"                # Yubikey management
brew "youtube-dl"           # youtube downloader
brew "z"                    # fuzzy cd to most used places
brew "zsh"

if ENV["OWN_PERSONAL_DEVICE"]

  # Empty

end

# ------------------------------------------------------------------------------
# Apps

cask "anki"
cask "calibre"              # ebook management
cask "coconutbattery"
cask "discord"
cask "disk-inventory-x"
cask "firefox"
cask "flameshot"
cask "flux"
cask "folx"                 # file/torrent downloader
cask "foobar2000"
cask "freecad"              # Free CAD software
cask "gimp"
cask "google-chrome"
cask "itsycal"
cask "keepassxc"
cask "keka"
cask "kitty"
cask "microsoft-edge"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "openscad"             # 3D CAD using code
cask "super-productivity"
cask "table-tool"
cask "veracrypt"            # encryption
cask "visual-studio-code"
cask "vlc"
cask "vox"                  # winamp-like audio player

if ENV["OWN_PERSONAL_DEVICE"]

  cask "blender"
  cask "ghidra"
  cask "steam"
  cask "qbittorrent"

end
